{
  "aboute": "About",
  "services": "Our Services",
  "portfolio": "Portfolio",
  "blog": "News",
  "contact": "Contact",
  "get_in_touch": "Get In Touch",
  "home": "Home",
  "intro": "We Are Here",
  "heading": "Better Insights For Business Growth",
  "view_more": "View More",
  "label": "About Us",
  "title": "Ready to boost your business growth?",
  "description": "COMPLEX SOLUTIONS LLC is your reliable partner in digital transformation. We provide full-cycle IT services, including custom web and mobile app development, IT consulting, process automation, and ongoing technical support. Every project is a solution tailored to your needs!",
  "button": "View more",
  "text": "This is an IT company specializing in software development, system integration, and digital transformation of businesses. We offer comprehensive services for creating, implementing, and supporting software solutions while ensuring high quality and reliability for our clients. Our experience includes collaboration with both international and local companies, as well as the implementation of complex projects in various industries.",
  "resident": "The company is a resident of IT-PARK Uzbekistan.",
  "serviceone": "Technical support and maintenance: Software updates, modernization, and technical assistance",
  "servicetwo": "Technical documentation preparation: Project passport, concept, and technical specifications with assistance for expert review by authorized bodies",
  "servicethree": "Software development: Turnkey solutions including web applications, mobile apps, and enterprise systems",
  "servicefour": "IT consulting: Analysis, optimization, and automation of business processes",
  "servicefive": "Full-cycle development and implementation of IT projects",
  "all": "All",
  "life": "Telecommunications",
  "statistic": "Complex Solution — your trusted partner for result-driven solutions.We value long-term and effective cooperation with our clients.For every project, we guarantee high-quality and practical solutions that meet modern standards and real business needs.",
  "nature": "Agriculture",
  "stories": "Finance",
  "travel": "Data Center",
  "education": "Education",
  "sector": "Service Sector",
  "lets_talk": "Hey! Let's Talk",
  "name": "Name",
  "email": "Email",
  "phone": "Phone",
  "message": "Your Message",
  "send_now": "Send Now",
  "call_anytime": "Call Anytime",
  "send_email": "Send Email",
  "visit_us": "Visit Us",
  "follow_us": "Follow us",
  "experience": "Our Expertise",
  "privacy_policy_agree": "I agree to the privacy policy",
  "thank_you_title": "Thank you!",
  "thank_you_message": "We will get back to you as soon as possible!",
  "ok_button": "OK",
  "result_title_1": "Commitment to Quality, Experience, and Results",
  "result_desc_1": "Our team doesn't just write code — we turn client dreams into reality.\nEvery project is a harmony of strategic thinking, creative approach, and technical excellence.\n\nWe take full responsibility for the results and pay attention to every detail.\nWorking with us means confidence in quality and a guarantee of outcomes.",
  "result_title_2": "Reliable Solutions, Determined Team",
  "result_desc_2": "We are a professional team with experience in creating secure and reliable solutions\nthat constantly innovate. Every challenge is a new opportunity, and we are ready to face it.\n\nEvery project is more than just work — it is a path to trustworthy partnership and tangible results.\nWe deeply understand our clients’ goals and offer the most convenient, modern, and efficient technological solutions.",
  "projects_title": "Our Projects",
  "projects_loading": "Loading...",
  "projects_error": "Error",
  "projects_view": "View Project",
  "advantages_title": "Why do clients choose us?",
  "advantages_subtitle": "/ Our Advantages /",
  "collapse": "Collapse",
  "expand": "Expand",
  "advantages_1_title": "Experience and Professionalism",
  "advantages_1_content": "Our team consists of skilled developers with extensive experience, deep-analytical analysts, and project managers who have successfully led major international projects.",
  "advantages_2_title": "Individual Approach",
  "advantages_2_content": "We analyze each client’s needs and business processes thoroughly and offer the best, most effective, and tailored solutions.",
  "advantages_3_title": "Modern Technologies",
  "advantages_3_content": "We use advanced technologies, including artificial intelligence and machine learning.",
  "advantages_4_title": "Quality Assurance",
  "advantages_4_content": "High quality standards, process transparency, and commitment to clients are our priorities.",
  "advantages_5_title": "Adaptability",
  "advantages_5_content": "We provide scalable solutions and quickly adapt to changing requirements efficiently.",
  "skill_title_part1": "Innovative approach",
  "skill_title_highlight": "for every",
  "skill_title_part2": "industry",
  "skill_button": "Get an estimate",
  "ourprocess": {
    "tagline": "\\ Planning \\",
    "title": "Our Process",
    "research": {
      "title": "Research",
      "description": "We begin with a deep analysis of your needs and project goals, ensuring a comprehensive approach."
    },
    "planning": {
      "title": "Planning",
      "description": "We define key stages and resources for effective execution, developing a detailed plan and strategy."
    },
    "execution": {
      "title": "Execution",
      "description": "We begin implementation, strictly following the plan and ensuring high-quality delivery of all tasks."
    },
    "testing": {
      "title": "Testing",
      "description": "We ensure reliability and compliance with modern standards through thorough testing and refinements."
    }
  },
  "stats": {
    "projects": "Successful projects",
    "services": "Business services",
    "reviews": "Positive reviews",
    "partners": "International partners"
  },
  "our_services": "Our Services",
  "tech_support": "Technical Support",
  "documentation": "Documentation",
  "software_solutions": "Software Solutions",
  "consulting": "Consulting",
  "it_projects": "IT Projects",
  "back_to_home": "Back to Home",
  "portfolio_education": {
    "title": "Online learning platform for a company in Tashkent, Uzbekistan",
    "description": "A learning platform for occupational safety training and certification developed for LLC 'CENTR BEZOPASNOSTI TRUDA'. Includes a course builder, Click and Payme payment integration, and automatic certificate generation after course completion. Advantages: remote education, convenient payment, automatic certificates, course purchase monitoring, and content protection.",
    "features": [
      "✓ Protected content from downloading",
      "✓ Click and Payme",
      "✓ Course builder",
      "✓ Participant progress analytics",
      "✓ Online chat",
      "✓ User-friendly admin interface"
    ]
  },
  "footer": {
    "about_us": "About Us",
    "about_us_text": "COMPLEX SOLUTIONS LLC is a full-cycle IT service provider focused on delivering innovative, scalable, and secure digital solutions for businesses.",
    "services": "Services",
    "services_list": {
      "web": "Web Development",
      "app": "Mobile App Development",
      "uiux": "UI/UX Design",
      "hubspot": "CRM Integration",
      "email": "Email Marketing Automation",
      "migration": "Platform Migration"
    },
    "career": "Career Opportunities",
    "career_roles": {
      "react": {
        "title": "React Developer",
        "exp": "1-5 Years Experience"
      },
      "wordpress": {
        "title": "WordPress Developer",
        "exp": "1-5 Years Experience"
      },
      "python": {
        "title": "Python Developer",
        "exp": "1-5 Years Experience"
      }
    },
    "subscribe": "Join Our Network",
    "subscribe_text": "Stay updated with the latest technology insights, trends, and company news. Join our newsletter for exclusive content.",
    "admin_button": "Admin Portal"
  },
  "welcome": "Welcome!",
  "phoneLabel": "Phone Number",
  "phonePlaceholder": "+998",
  "passwordLabel": "Password",
  "passwordPlaceholder": "Password",
  "showPassword": "Show password",
  "hidePassword": "Hide password",
  "togglePassword": "Show / hide",
  "forgotPassword": "Forgot password?",
  "signInButton": "Sign In",
  "tech_support_title": "Technical Support and Maintenance",
  "tech_support_1_title": "Support and Updates",
  "tech_support_1_desc": "We regularly update the developed software. New features are added to improve security, platform compatibility, and user experience.",
  "tech_support_2_title": "Modernization",
  "tech_support_2_desc": "We offer services to improve interface design, increase performance, and integrate with modern technologies tailored to client needs.",
  "tech_support_3_title": "Fast Technical Assistance",
  "tech_support_3_desc": "We provide quick support in case of any malfunction or technical issue. Problems are resolved remotely or on-site, with clear explanations and guidance for users.",
  "documentation_title": "Preparation of technical documentation and assistance during examination",
  "documentation_1_title": "Software Product Passport",
  "documentation_1_desc": "An official document that includes full information about the technical specifications, functional capabilities, and usage of the product.",
  "documentation_2_title": "Project Concept Development",
  "documentation_2_desc": "A conceptual document describing the project's goals, key tasks, technological solutions, implementation stages, and expected results.",
  "documentation_3_title": "Assistance with Government Examination",
  "documentation_3_desc": "Submitting technical documentation to relevant authorities; adapting documents to meet examination requirements; providing technical and legal support for compliance, licensing, or official approval.",
  "software_title": "Software Development",
  "software_1_title": "Turn-key Solutions",
  "software_1_desc": "We develop fully functional and ready-to-use systems: including design, backend, frontend, and testing.",
  "software_2_title": "Web Applications",
  "software_2_desc": "We develop effective web platforms based on modern technologies, tailored to your business needs.",
  "software_3_title": "Mobile Applications",
  "software_3_desc": "We create fast, convenient, and reliable mobile apps for iOS and Android, and publish them on App Store/Google Play.",
  "software_4_title": "Enterprise Systems",
  "software_4_desc": "We develop ERP, CRM, HRM and other corporate solutions to automate your internal business processes.",
  "software_5_title": "Tech Consulting and Project Management",
  "software_5_desc": "We offer IT consulting, risk analysis, and technical supervision to ensure successful project execution.",
  "support_title": "Technical Support and Software Maintenance",
  "support_1_title": "Regular Software Updates",
  "support_1_desc": "We keep software up to date through security patches, increased system stability, and the introduction of new features.",
  "support_2_title": "System Modernization",
  "support_2_desc": "We optimize existing platforms to meet modern standards — updating design, improving performance, and ensuring compatibility with new technologies.",
  "support_3_title": "Quick Technical Assistance",
  "support_3_desc": "We respond quickly to any software issues. Problems are solved remotely or on-site, with user guidance and support provided.",
  "support_4_title": "Monitoring and Analysis",
  "support_4_desc": "We continuously monitor system performance to detect and resolve issues proactively, ensuring stability and service continuity.",
  "support_5_title": "User Training and Consultation",
  "support_5_desc": "We provide users with instructions and practical support for setup, troubleshooting, and proper software usage.",
  "fullcycle_title": "Full-Cycle Development and Implementation of IT Projects",
  "fullcycle_1_title": "Regular Software Updates",
  "fullcycle_1_desc": "We keep software up to date with security patches, improved stability, and newly introduced features.",
  "fullcycle_2_title": "System Modernization",
  "fullcycle_2_desc": "We optimize existing platforms by updating the design, improving performance, and integrating new technologies.",
  "fullcycle_3_title": "Fast Technical Support",
  "fullcycle_3_desc": "We quickly respond to any software issue. Problems are resolved remotely or on-site, and users are provided with guidance and skills.",
  "fullcycle_4_title": "Monitoring and Analysis",
  "fullcycle_4_desc": "We continuously monitor the system to detect and fix issues early, ensuring product stability and uninterrupted service.",
  "fullcycle_5_title": "User Training and Consultation",
  "fullcycle_5_desc": "We provide users with clear instructions and practical support for using, configuring, and troubleshooting the software.",
  "contact_button": "Contact"
}