{
  "aboute": "О нас",
  "services": "Наши услуги",
  "portfolio": "Портфолио",
  "blog": "Новости",
  "contact": "Контакты",
  "statistic": "Complex Solution — ваш надёжный партнёр, предлагающий решения, ориентированные на результат. Мы ценим долгосрочное и эффективное сотрудничество с нашими клиентами. Для каждого проекта мы гарантируем качественные и практичные решения, соответствующие современным требованиям и реальным потребностям бизнеса.",
  "get_in_touch": "Связаться",
  "home": "Главная",
  "intro": "Мы здесь",
  "heading": "Лучшее понимание для роста бизнеса",
  "view_more": "Посмотреть",
  "label": "О нас",
  "title": "Готовы к стремительному росту вашего бизнеса?",
  "description": "COMPLEX SOLUTIONS LLC — ваш надежный партнер в цифровой трансформации. Мы предоставляем полный спектр ИТ-услуг, включая разработку веб и мобильных приложений, ИТ-консалтинг, автоматизацию процессов и техническую поддержку. Каждый проект — это решение, адаптированное под ваши потребности!",
  "button": "Посмотреть",
  "text": "Это ИТ-компания, специализирующаяся на разработке программного обеспечения, системной интеграции и цифровой трансформации бизнеса. Мы предлагаем комплексные услуги по созданию, внедрению и поддержке программных решений, обеспечивая высокое качество и надежность для наших клиентов. Наш опыт включает сотрудничество с международными и локальными компаниями, а также реализацию сложных проектов в различных отраслях.",
  "resident": "Компания является резидентом IT-PARK Узбекистан.",
  "serviceone": "Техническая поддержка и сопровождение: обновление ПО, модернизация и техническая помощь",
  "servicetwo": "Подготовка технической документации: паспорт проекта, концепция и технические спецификации с сопровождением экспертизы в уполномоченных органах",
  "servicethree": "Разработка программного обеспечения: готовые решения, включая веб-приложения, мобильные приложения и корпоративные системы",
  "servicefour": "ИТ-консалтинг: анализ, оптимизация и автоматизация бизнес-процессов",
  "servicefive": "Полный цикл разработки и внедрения ИТ-проектов",
  "all": "Все",
  "life": "Телекоммуникации",
  "moments": "Медицина",
  "nature": "Сельское хозяйство",
  "stories": "Финансы",
  "travel": "Дата-центр",
  "education": "Образование",
  "sector": "Сфера услуг",
  "lets_talk": "Привет! Давайте поговорим",
  "name": "Имя",
  "email": "Электронная почта",
  "phone": "Телефон",
  "message": "Ваше сообщение",
  "send_now": "Отправить",
  "call_anytime": "Звоните в любое время",
  "send_email": "Отправить email",
  "visit_us": "Посетите нас",
  "follow_us": "Подписывайтесь на нас",
  "experience": "Наш опыт",
  "privacy_policy_agree": "Я согласен с политикой конфиденциальности",
  "thank_you_title": "Спасибо!",
  "thank_you_message": "Мы свяжемся с вами в ближайшее время!",
  "ok_button": "ОК",
  "result_title_1": "Стремление к качеству, опыту и результату",
  "result_desc_1": "Наша команда не просто пишет код — мы воплощаем мечты клиентов в реальность.\nКаждый проект — это сочетание стратегического мышления, креативного подхода и технического совершенства.\n\nМы полностью берем на себя ответственность за результат и уделяем внимание каждой детали.\nРаботать с нами — это уверенность в качестве и гарантия результата.",
  "result_title_2": "Надежные решения, сплочённая команда",
  "result_desc_2": "Мы — профессиональная команда, обладающая опытом в создании безопасных и надежных решений\nи постоянно обновляющая инновации. Для нас любое затруднение — это новая возможность, и мы к ней готовы.\n\nКаждый проект — не просто работа, а путь к надежному партнёрству и достижению результатов.\nМы глубоко понимаем цели наших клиентов и предоставляем им наиболее удобные, современные и эффективные технологические решения.",
  "projects_title": "Наши проекты",
  "projects_loading": "Загрузка...",
  "projects_error": "Ошибка",
  "projects_view": "Посмотреть проект",
  "advantages_title": "Почему выбирают нас?",
  "advantages_subtitle": "/ Наши преимущества /",
  "collapse": "Скрыть",
  "expand": "Показать",
  "advantages_1_title": "Опыт и профессионализм",
  "advantages_1_content": "В нашей команде работают квалифицированные разработчики с большим опытом, аналитики и менеджеры, успешно реализовавшие крупные международные проекты.",
  "advantages_2_title": "Индивидуальный подход",
  "advantages_2_content": "Мы тщательно анализируем потребности каждого клиента и их бизнес-процессы, предлагая наилучшие и адаптированные решения.",
  "advantages_3_title": "Современные технологии",
  "advantages_3_content": "Мы используем передовые технологии, включая искусственный интеллект и машинное обучение.",
  "advantages_4_title": "Гарантия качества",
  "advantages_4_content": "Высокие стандарты качества, прозрачность процессов и обязательства перед клиентами являются нашими приоритетами.",
  "advantages_5_title": "Адаптивность",
  "advantages_5_content": "Мы обеспечиваем гибкость и быструю адаптацию к изменяющимся требованиям и масштабируемость проектов.",
  "skill_title_part1": "Инновационный подход",
  "skill_title_highlight": "для каждой",
  "skill_title_part2": "отрасли",
  "skill_button": "Получить оценку",
  "footer": {
    "about_us": "О нас",
    "about_us_text": "COMPLEX SOLUTIONS LLC — это поставщик IT-услуг полного цикла, ориентированный на предоставление инновационных, масштабируемых и безопасных цифровых решений для бизнеса.",
    "services": "Услуги",
    "services_list": {
      "web": "Веб-разработка",
      "app": "Разработка мобильных приложений",
      "uiux": "UI/UX Дизайн",
      "hubspot": "Интеграция CRM",
      "email": "Автоматизация Email-маркетинга",
      "migration": "Миграция платформ"
    },
    "career": "Вакансии",
    "career_roles": {
      "react": {
        "title": "Разработчик React",
        "exp": "Опыт 1–5 лет"
      },
      "wordpress": {
        "title": "Разработчик WordPress",
        "exp": "Опыт 1–5 лет"
      },
      "python": {
        "title": "Разработчик Python",
        "exp": "Опыт 1–5 лет"
      }
    },
    "subscribe": "Присоединяйтесь к нашей сети",
    "subscribe_text": "Будьте в курсе последних технологических новинок, тенденций и новостей компании. Подпишитесь на нашу рассылку для эксклюзивного контента.",
    "admin_button": "Админ-панель"
  },
  "ourprocess": {
    "tagline": "\\ Планирование \\",
    "title": "Наш процесс",
    "research": {
      "title": "Исследование",
      "description": "Мы начинаем с глубокого анализа ваших потребностей и целей проекта, обеспечивая комплексный подход."
    },
    "planning": {
      "title": "Планирование",
      "description": "Определяем ключевые этапы и ресурсы для эффективной реализации, разрабатываем подробный план и стратегию."
    },
    "execution": {
      "title": "Исполнение",
      "description": "Приступаем к реализации проекта, строго следуем плану и гарантируем высокое качество выполнения всех задач."
    },
    "testing": {
      "title": "Тестирование",
      "description": "Обеспечиваем надежность проекта и соответствие современным требованиям с помощью тщательных тестов и доработок."
    }
  },
  "stats": {
    "projects": "Успешных проектов",
    "services": "Услуг для бизнеса",
    "reviews": "Положительных отзывов",
    "partners": "Зарубежных партнёров"
  },
  "our_services": "Наши услуги",
  "tech_support": "Техническая поддержка",
  "documentation": "Документация",
  "software_solutions": "Программные решения",
  "consulting": "Консалтинг",
  "it_projects": "IT-проекты",
  "back_to_home": "Вернуться на главную",
  "portfolio_education": {
    "title": "Платформа онлайн обучения для компании в г.Ташкент, Узбекистан",
    "description": "Разработана платформа онлайн-обучения и повышения квалификации специалистов по охране труда для компании ООО 'CENTR BEZOPASNOSTI TRUDA'. Включает конструктор курсов, онлайн-оплату через Click и Payme, и автоматическую генерацию сертификатов по окончании. Преимущества: удалённое обучение, удобная оплата, автоматические сертификаты, мониторинг покупок курсов, защита контента.",
    "features": [
      "✓ Защищённость контента от скачивания",
      "✓ Click и Payme",
      "✓ Конструктор курсов",
      "✓ Аналитика прогресса участников",
      "✓ Онлайн чат",
      "✓ Удобный интерфейс управления"
    ]
  },
  "welcome": "Добро пожаловать!",
  "phoneLabel": "Номер телефона",
  "phonePlaceholder": "+998",
  "passwordLabel": "Пароль",
  "passwordPlaceholder": "Пароль",
  "showPassword": "Показать пароль",
  "hidePassword": "Скрыть пароль",
  "togglePassword": "Показать / скрыть",
  "forgotPassword": "Забыли пароль?",
  "signInButton": "Войти",
  "tech_support_title": "Техническая поддержка и сопровождение",
  "tech_support_1_title": "Поддержка и обновления",
  "tech_support_1_desc": "Мы регулярно обновляем разработанное программное обеспечение. Добавляем новые функции для повышения безопасности, совместимости и удобства использования.",
  "tech_support_2_title": "Модернизация",
  "tech_support_2_desc": "Предоставляем услуги по улучшению дизайна интерфейса, повышению производительности и интеграции с современными технологиями в соответствии с потребностями клиента.",
  "tech_support_3_title": "Оперативная техническая помощь",
  "tech_support_3_desc": "Мы оперативно решаем любые неисправности и технические проблемы. Предоставляем поддержку удалённо или на месте, объясняем и консультируем пользователей.",
  "documentation_title": "Разработка технической документации и помощь при проведении экспертизы",
  "documentation_1_title": "Подготовка паспорта программного продукта",
  "documentation_1_desc": "Официальный документ, содержащий полную информацию о технических характеристиках, функциональных возможностях и применении продукта.",
  "documentation_2_title": "Разработка концепции проекта",
  "documentation_2_desc": "Концептуальный документ, описывающий цели проекта, основные задачи, технологические решения, этапы внедрения и ожидаемые результаты.",
  "documentation_3_title": "Сопровождение при проведении экспертизы",
  "documentation_3_desc": "Передача технической документации в соответствующие органы; адаптация документов в соответствии с требованиями экспертизы; техническая и юридическая помощь для соблюдения требований, лицензирования или получения официальных одобрений.",
  "software_title": "Разработка программного обеспечения",
  "software_1_title": "Решения под ключ",
  "software_1_desc": "Мы разрабатываем полностью готовые к использованию системы: дизайн, бэкенд, фронтенд и тестирование.",
  "software_2_title": "Веб-приложения",
  "software_2_desc": "Разрабатываем эффективные веб-платформы на основе современных технологий, адаптированные под нужды бизнеса.",
  "software_3_title": "Мобильные приложения",
  "software_3_desc": "Создаем быстрые, удобные и надежные мобильные приложения для iOS и Android и публикуем их в App Store/Google Play.",
  "software_4_title": "Корпоративные системы",
  "software_4_desc": "Разрабатываем ERP, CRM, HRM и другие корпоративные решения для автоматизации внутренних бизнес-процессов.",
  "software_5_title": "Технический консалтинг и управление проектами",
  "software_5_desc": "Предлагаем IT-консалтинг, анализ рисков и технический надзор для успешной реализации проекта.",
  "support_title": "Техническая поддержка и сопровождение программного обеспечения",
  "support_1_title": "Регулярное обновление программ",
  "support_1_desc": "Мы поддерживаем программное обеспечение в актуальном состоянии с помощью обновлений безопасности, улучшения стабильности и новых функций.",
  "support_2_title": "Модернизация системы",
  "support_2_desc": "Оптимизируем существующие платформы согласно современным требованиям — обновляем дизайн, повышаем производительность, внедряем новые технологии.",
  "support_3_title": "Быстрая техническая помощь",
  "support_3_desc": "Мы оперативно реагируем на любые сбои в работе ПО. Решаем проблемы удаленно или на месте, предоставляем инструкции и консультации пользователям.",
  "support_4_title": "Мониторинг и анализ",
  "support_4_desc": "Постоянно отслеживаем работу системы, заранее выявляем и устраняем проблемы. Это обеспечивает стабильность и непрерывность сервиса.",
  "support_5_title": "Обучение пользователей и консультации",
  "support_5_desc": "Предоставляем инструкции и практическую помощь пользователям для правильного использования, настройки и устранения неполадок.",
  "fullcycle_title": "Полный цикл разработки и внедрения IT-проектов",
  "fullcycle_1_title": "Регулярное обновление программного обеспечения",
  "fullcycle_1_desc": "Мы поддерживаем актуальность ПО с помощью обновлений безопасности, повышения стабильности и внедрения новых функций.",
  "fullcycle_2_title": "Модернизация системы",
  "fullcycle_2_desc": "Оптимизируем платформу — обновляем дизайн, повышаем производительность и внедряем новые технологии.",
  "fullcycle_3_title": "Быстрая техническая помощь",
  "fullcycle_3_desc": "Оперативно реагируем на любые сбои. Устраняем их удалённо или на месте, обучаем и консультируем пользователей.",
  "fullcycle_4_title": "Мониторинг и анализ",
  "fullcycle_4_desc": "Постоянно отслеживаем состояние системы, выявляем проблемы заранее и устраняем их, обеспечивая стабильность.",
  "fullcycle_5_title": "Обучение и консультации для пользователей",
  "fullcycle_5_desc": "Предоставляем инструкции и практическую помощь пользователям для правильного использования и устранения неполадок.",
  "contact_button": "Связаться"
}